app/Controllers/user/Aktivitasctrl.php

    public function index()
    {
        $lang = session()->get('lang') ?? 'en';

        $meta = $this->MetaModel->where('nama_halaman', 'Klien')->first();

        $data = [
            'profil' => $this->ProfilModel->findAll(),
            'tbslider' => $this->SliderModel->findAll(),
            'tbproduk' => $this->ProdukModel->findAll(),
            'tbaktivitas' => $this->AktivitasModel->findAll(),
            'lang' => $lang,
            'meta' => $meta,
        ];
---
SELECT *
FROM `tb_meta`
WHERE `nama_halaman` = 'Klien'
 LIMIT 1
SELECT *
FROM `tb_profil`
SELECT *
FROM `tb_slider`
SELECT *
FROM `tb_produk`
SELECT *
FROM `tb_aktivitas`