app/Controllers/user/Artikelctrl.php

SELECT *
FROM `tb_meta`
WHERE `nama_halaman` = 'Blog'
 LIMIT 1
SELECT *
FROM `tb_profil`
SELECT *
FROM `tb_slider`
---
    public function index()
    {
        // Ambil bahasa dari session, default 'en'
        $lang = session()->get('lang') ?? 'en';

        $meta = $this->MetaModel->where('nama_halaman', 'Blog')->first();

        $data = [
            'profil' => $this->ProfilModel->findAll(),
            'tbslider' => $this->SliderModel->findAll(),
            'artikelterbaru' => $this->ArtikelModel->getArtikelTerbaru(),
            'lang' => $lang,
            'meta' => $meta
        ];