app/Controllers/user/Productsctrl.php

    public function index()
    {
        $lang = session()->get('lang') ?? 'en';

        $meta = $this->MetaModel->where('nama_halaman', 'Materi Pelatihan')->first();

        $data = [
            'profil' => $this->ProfilModel->findAll(),
            'tbslider' => $this->SliderModel->findAll(),
            'tbproduk' => $this->ProdukModel->findAll(),
            'lang' => $lang,
            'meta' => $meta
        ];
---
SELECT *
FROM `tb_meta`
WHERE `nama_halaman` = 'Materi Pelatihan'
 LIMIT 1
SELECT *
FROM `tb_profil`
SELECT *
FROM `tb_slider`
SELECT *
FROM `tb_produk`

    public function detail($slug_produk)
    {
        $lang = session()->get('lang') ?? 'id';  // Set default language to Indonesian if no session is found.

        // Cari produk berdasarkan slug
        $produk = $this->ProdukModel->where('slug_id', $slug_produk)
            ->orWhere('slug_en', $slug_produk)
            ->first();
---
SELECT *
FROM `tb_produk`
WHERE `slug_id` = 'pelatihan-ekspor'
OR `slug_en` = 'pelatihan-ekspor'
 LIMIT 1