app/Models/ArtikelModel.php

SELECT *
FROM `tb_artikel`
ORDER BY `id_artikel` DESC
---
    public function getArtikelTerbaru()
    {
        return $this->orderBy('id_artikel', 'desc')
            ->findAll();